{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_1", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "act_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "final_weight", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "final_bias", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "final", 
      "attr": {"num_hidden": "1"}, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "perte_lineaire_label", 
      "inputs": []
    }, 
    {
      "op": "LinearRegressionOutput", 
      "name": "perte_lineaire", 
      "inputs": [[7, 0, 0], [8, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 5, 6, 8], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10
  ], 
  "heads": [[9, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 905]}
}